package Day04;

public class Day04_Q2 {
/*
 * 2. 회원제 방문록 프로그램
 *  [조건1] : 최대 100명을 저장할 수 있는 회원 배열[아이디, 비밀번호]
 *  [조건2] : 초기메뉴
 *   	1. 로그인
 *   	2. 회원가입
 *  [회원가입을 선택했을 때]
 *  	1. 아이디와 비밀번호를 입력받아 배열에 저장
 *  	2. 아이디 중복 불가[배열에 기존 아이디가 존재하면 회원가입 실패]
 *  [로그인을 선택 했을 때]
 *  	1. 아이디와 비밀번호를 입력받아 배열 내 존재하면 로그인 성공 // 아니면 실패
 *  [로그인 성공시 메뉴]
 *  	1. 방문록 남기기
 *  	2. 로그아웃
 *  [방문록 남기기 선택했을때]
 *  	내용을 입력받아 배열에 저장(내용과 작성자 아이디 저장)
 *  	기존 방문록 목록 출력
 *  [로그아웃]
 *  	초기메뉴로 돌아가기
 */
	public static void main(String[] args) {
		
	}

}
